Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: གངས་ཏི་སེ་ལྟ་བུ་སྟེགས་བུ་དང་། སྒོ་གང་དང་། རྟ་བབས་དང་། སྐར་ཁུང་དང་། བསིལ་ཁང་དང་། ཁང་པ་བརྩེགས་པ་དང་། ཁྱམས་ཀྱིས་ལེགས་པར་བརྒྱན་པ།
en: Since your palaces are the color of autumn clouds, they resemble Mount Kailāśa. They are adorned with verandas, arches, portals, windows, cooling terraces, and top-floor terraces.

source: རིན་པོ་ཆེའི་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་སྒྲ་འབྱུང་བ་འདི་དག་དང་། བཙུན་མོའི་འཁོར་དང་རོལ་མོའི་ཆ་བྱད་རྒྱུད་གཅིག་པ་དང་། པི་བང་དང་། ཁར་རྔ་དང་། གླིང་བུ་དང་། ཁར་བའི་སིལ་ཁྲོལ་དང་། ཕེག་དང་། ཀིམ་པ་ལ་དང་། ན་ཀུ་ལ་དང་། སྒྲ་སྙན་དང་། རྫ་རྔ་དང་། པ་ཊ་ཧ་དང་། གླུ་དང་། གར་དང་། རོལ་མོའི་དབྱངས་སྒྲ་དང་། གླུ་དབྱངས་སྦྱར་བ་ལེགས་པར་བསླབས་པ་དགོད་པ་དང་། འཇོ་བ་དང་། རྩེ་བ་དང་། དགའ་བ་དང་། ཚུལ་དུ་ཤིས་པ་དང་། སྤྱོད་པ་མཛེས་པ་འདི་དང་ནི་ལྡན་ལ།
en: They resound with the tinkling of tiny bejeweled bells on latticed draperies. “Your retinue of consorts is well trained. They sing songs while playing melodious music and dancing. They play tuṇas, paṇavas, flutes, lutes, wood kettledrums, reed pipes, wooden pins, cymbals, kimpalas, nakalus, guitars, clay kettledrums with a good sound, and paṭahas. They attend upon you with comedy and dance—playful, enjoyable, happy, and sweet.

source: ལྷ་ཁྱོད་ཀྱང་དར་ནི་མ་ཡོལ་ཏེ། གཞོན་པ་ཐོར་བུ་དར་ལ་བབ་པ། ལུས་འཇམ་པ།
en: “And you, my Lord, are still young. You are in the prime of your life.

source: ལང་ཚོ་ལ་བབ་པ། དབུ་སྐྲ་གནག་པ།
en: You are a fresh and tender boy with black hair and a body like a lotus.

source: འདོད་པ་ལ་མ་རོལ་པ་ལགས་ཀྱིས།
en: You have not yet given yourself to the pleasures of the senses.

source: སུམ་ཅུ་རྩ་གསུམ་པའི་བདག་པོ་མིག་སྟོང་དང་ལྡན་པ་ལྷའི་བདག་པོ་ལྟ་བུར་རེ་ཤིག་དགྱེས་པར་རོལ་ལ།
en: So now enjoy yourself, like the lord of the Heaven of the Thirty-Three, the lord of the gods, the one endowed with a thousand eyes.

source: སླད་ཀྱིས་བགྲེས་ནས་མངོན་པར་འབྱུང་བར་མཛོད་ཅིག །དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་ཡང་སྨྲས་སོ།
en: We can always leave our homes later, once we are old.” At that moment Chanda spoke the following verse:

source: །སུམ་ཅུ་རྩ་གསུམ་འཇིག་རྟེན་ལྷ་དབང་ལྟར། །དགྱེས་པའི་ཆོ་ག་མཁྱེན་པ་དགྱེས་པར་རོལ།
en: “You know the techniques of enjoyment, so relish them, Like the powerful lord of gods in the Heaven of the Thirty-Three!

source: །སླད་ཀྱིས་བགྲེས་པར་གྱུར་ནས་བརྟུལ་ཞུགས་དང་། །དཀའ་ཐུབ་དག་ནི་ཡང་དག་བརྩམ་པར་མཛོད།
en: Later, when we are old, We can practice disciplined conduct and austerities!”

source: འདུན་པ་མི་དགོས་ཏེ། འདོད་པ་འདི་དག་ནི་མི་རྟག་པ།
en: “Enough, Chanda! These sense pleasures are impermanent and unstable.

source: མི་བརྟན་པ། ཐེར་ཟུག་མ་ཡིན་པ། འགྱུར་བའི་ཆོས་ཅན།
en: They do not endure and are subject to change.

source: མྱུར་དུ་འགྲོ་བ། གཡོ་བ། རི་གཟར་པོའི་ཆུའི་ཤུགས་དང་འདྲ་བ།
en: Like the rapids of a mountain torrent, they quickly pass and are turbulent.

source: ཟིལ་པའི་ཐིགས་པ་ལྟར་རིང་དུ་མི་གནས་པ།
en: Like dewdrops, they do not last.

source: ལག་པ་བཅངས་པ་སྟོངས་པས་བྱིས་པ་བྲིད་པ་ལྟར་སྙིང་པོ་མེད་པ།
en: Like an empty fist that tricks a child, they have no substance.

source: ཆུ་ཤིང་གི་སྙིང་པོ་ལྟར་མཐུ་མེད་པ།
en: Like the core of a plantain tree, they have no strength.

source: སྣོད་སོ་མ་བཏང་བ་ལྟར་མཐར་འཇིག་པ།
en: Like a vase of unbaked clay, they naturally break.

source: སྟོན་ཀའི་སྤྲིན་ལྟར་སྐད་ཅིག་བྱུང་ནས་མེད་པར་འགྱུར་བ།
en: Like autumn clouds, they appear one moment and vanish the next.

source: ནམ་མཁའི་གློག་ལྟར་རིང་དུ་མི་གནས་པ།
en: Like a flash of lightning in the sky, they last for just the briefest time.

source: དུག་དང་བཅས་པའི་སྣོད་ལྟར་འགྱུར་བའི་སྡུག་བསྔལ་ཅན།
en: Like a vessel filled with poison, they cause pain.

source: འཁྲི་ཤིང་མ་ལུ་ཏ་ལྟར་མི་བདེ་བ་འབྱིན་པ།
en: Like poison ivy, they bring discomfort.

source: བྱིས་པའི་བློ་ཅན་རྣམས་ཀྱིས་འདོད་པར་བྱ་བ། ཆུའི་ཆུ་བུར་ལྟ་བུར་མྱུར་དུ་འགྱུར་བའི་ཆོས་ཅན།
en: “The objects of desire, which are desperately craved by all those with immature minds, are like water bubbles, always changing.

source: སྨིག་རྒྱུ་ལྟར་འདུ་ཤེས་ཕྱིན་ཅི་ལོག་ལས་བྱུང་བ།
en: Like a mirage, they are caused by mistaken perception.

source: སྒྱུ་མ་ལྟར་སེམས་ཕྱིན་ཅི་ལོག་གིས་རྣམ་པར་བསྒྲུབས་པ།
en: They are like a hallucination that has come about through false thinking.

source: རྨི་ལམ་ལྟར་ལྟ་བ་ཕྱིན་ཅི་ལོག་གིས་ཡོངས་སུ་ཟིན་པ།
en: Just like dreams, they cannot satisfy, since one is grasping at a false appearance.

source: རྒྱ་མཚོ་དགང་དཀའ་བ་ལྟར་ངོམས་མི་ཤེས་པར་བྱེད་པ།
en: Just as it is difficult to fill the oceans, desires can never be fulfilled.

source: ཚྭ་ཆུ་ལྟར་སྐོམ་པར་བྱེད་པ།
en: Like salty water, objects of desire only make you thirstier.

source: སྦྲུལ་གྱི་མགོ་ལྟར་རེག་པར་བྱ་དཀའ་བ།
en: Like the head of a viper, they are dangerous to touch.

source: གཡང་ས་ཆེན་པོ་ལྟར་མཁས་པ་རྣམས་ཀྱིས་ཡོངས་སུ་སྤངས་པ།
en: Like a deep abyss, they are abandoned entirely by wise people.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱིས་འཇིགས་པ་དང་བཅས་པ་དང་། རྩོད་པ་དང་བཅས་པ་དང་། ཉེས་པ་དང་བཅས་པ་དང་། སྐྱོན་དང་བཅས་པར་ཤེས་ནས་རྣམ་པར་སྤངས་པ།
en: They produce anxiety, cause strife, and generate distress and faults.

source: རིག་པ་རྣམས་ཀྱིས་སྨད་པ། འཕགས་པ་རྣམས་ཀྱིས་བཤུངས་པ། མཁས་པ་རྣམས་ཀྱིས་མ་བསྔགས་པ།
en: Knowing this, the wise ones avoid them, the clever ones deplore them, the noble ones abhor them, and the intelligent ones disparage them.

source: མི་མཁས་པ་རྣམས་ཀྱིས་ཡོངས་སུ་བཟུང་བ། བྱིས་པ་རྣམས་ཀྱིས་བསྟེན་པ་ཡིན་ནོ།
en: Yet the ignorant embrace them, and the immature rely on them.”

source: །དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་ཡང་སྨྲས་སོ།
en: At that moment he spoke the following verses:

source: །མཁས་པ་རྣམས་ཀྱིས་སྦྲུལ་གྱི་མགོ་བཞིན་སྤངས།
en: “Wise people avoid the sense pleasures like the head of a snake;

source: །ངན་སྐྱུགས་སྣོད་བཞིན་མི་གཙང་རྣམ་པར་སྤངས།
en: They drop them like a filthy vessel filled with excrement. Chanda, since I understand that sense pleasures

source: །འདུན་པ་དགེ་བ་ཐམས་ཅད་འཇིག་བྱེད་པར། །འདོད་པ་ཤེས་ནས་ང་ནི་དགའ་མི་སྐྱེ།
en: Destroy all virtue, I do not enjoy them.”

source: །དེའི་ཚེ་འདུན་པ་ཟུག་རྔུས་ཟུག་པ་བཞིན་དུ་སྐད་ཕྱུང་སྟེ།
en: Then Chanda, wailing as if in sharp pain, with tearful eyes and stricken with agony, exclaimed the following verses:

source: ངུ་ཞིང་དེ་ནས་མིག་ནས་མཆི་མ་ཟག་ལ། སྡུག་བསྔལ་བཞིན་ཚིག་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Why do some persevere in many austerities?

source: །ལྷ་ཅིག་གང་གི་དོན་དུ་འདི་ན་ཁ་ཅིག་བརྟུལ་ཞུགས་རྣམ་པ་མང་པོ་རྩོམ་སྟེ་རི་དགས་པགས་པ་འཆང་། །
en: They wear deerskin and let their hair, beard, and nails grow long; They cover themselves in tree bark. Adhering to their practices of austerities, many have emaciated bodies.

source: སྐྲ་དང་སེན་མོ་ཨག་ཙོམ་རིང་དུ་འཇོག་ཅིང་དེ་བཞིན་ཤིང་ཤུན་གྱོན་ལ་ཡན་ལག་སྐམས་ཤིང་བརྟུལ་ཞུགས་གནས། །སྲེད་དང་ནི་ལྡམ་ལྡུམ་དག་དང་དྲུས་མ་འབྲས་ཟ་ཁ་ཅིག་སྤྱིའུ་ཚུགས་འདུག་དང་བ་ལང་བརྟུལ་ཞུགས་གནས།
en: “Some eat only vegetables, millet, and the gardūla plant. Others, who have vowed to adopt the behavior of a cow, always keep their heads down.

source: །ཇི་ལྟར་བདག་ཅག་འགྲོ་བའི་གཙོ་བོ་ཁྱད་འཕགས་འཁོར་ལོས་སྒྱུར་བ་མཆོག་དང་དེ་བཞིན་འཇིག་རྟེན་སྐྱོང་བ་དང་། །བརྒྱ་བྱིན་རྡོ་རྗེ་འཆང་དང་འཐབ་བྲལ་ལྷ་དབང་འཕྲུལ་བར་འགྱུར་སྙམ་ཚངས་པའི་འཇིག་རྟེན་བསམ་གཏན་བདེ་བ་འདོད།
en: We, however, should become the best and most distinguished in the world; We should be supreme universal monarchs and guardians of the world, “Or vajra holders like Śakra, or the chief god in the Heaven Free from Strife, Aspiring to experience the bliss of meditation in the realm of Brahmā.

source: །མི་ཡི་དམ་པ་ཁྱོད་ཀྱི་རྒྱལ་སྲིད་འདི་ནི་ཤིན་ཏུ་འབྱོར་ཅིང་རབ་ཏུ་རྒྱས་ལ་ཤིན་ཏུ་ལོ་ལེགས་པ། །དེ་བཞིན་ཀུན་དགའི་ར་བ་དག་དང་སྐྱེད་མོས་ཚལ་དང་ཁང་བཟངས་མཐོན་པོ་རྣམ་པར་རྒྱལ་བའི་ཁང་པ་མཚུངས། །
en: Perfect Being, your kingdom is wealthy, flourishing with excellent harvests. Full of parks and palaces, it equals the Vaijayanta Palace.

source: བུད་མེད་འདི་དག་རྣམས་ཀྱང་པི་བང་དང་ནི་གླིང་བུ་དག་དང་གླུ་དང་རོལ་མོའི་དབྱངས་སྒྲ་ལེན་ཅིང་མཆིས།
en: “These ladies are well trained in offering pleasures, In combination with song and the melodious sounds of lutes and reed pipes. Enjoy these pleasures, my Lord!

source: །དགའ་བར་བགྱིད་དང་གར་དང་གླུ་དབྱངས་སྦྱར་བ་ཤིན་ཏུ་བསླབས་པ་འདི་དག་སྤྱོད་ཅིང་དེས་པ་མ་བཞུད་ཅིག །བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ།
en: If you do not leave, you will experience great delights!” The Bodhisattva answered:

source: འདུན་པ་ཉོན་ཅིག་འདོད་པའི་རྒྱུས་ནི་སྔོན་གྱི་ཚེ་རབས་དག་ན་བཅིངས་དང་བཙས་དང་བརྡེགས་དང་བསྡིགས་པ་སྡུག་བསྔལ་བརྒྱ་དག་ངས་ནི་བཟོད་བྱས་འདུས་བྱས་རྣམས་ལ་ང་ཡིས་ཡིད་བྱུང་བྱས་མ་གྱུར། །
en: “Listen, Chanda! In previous births I have endured hundreds of sufferings— Imprisonment, slavery, beatings, threats—all on account of desire. While my mind was fixed on conditioned things, I could not gain liberation.

source: སྔོན་ཆད་བག་མེད་དབང་དུ་སོང་ཞིང་གཏི་མུག་དཀྲུགས་ལ་ལྟ་བའི་དྲ་བས་དཀྲིགས་ཤིང་མུན་གྱུར་ཆོས་འདི་མི་ཤེས་པ་ལས་བྱུང་སྟེ་བདག་ཏུ་འདུ་ཤེས་འཛིན་དང་ཚོར་བ་པོ་ལས་འདས། །
en: “Under the sway of carelessness and overcome by delusion, I was blind in the past, covered with a veil of wrong views. Such views made me grasp at the notion of a self And perpetuate the experience of sensations, all due to not knowing the Dharma.

source: དངོས་པོ་འདི་དག་ཐམས་ཅད་གཡོ་ཞིང་འགྱུར་ལ་མི་རྟག་སྤྲིན་དང་མཚུངས་ཤིང་གློག་དང་འདྲ་སྟེ་ཟིལ་པའི་ཐིགས་པ་འདྲ་ཞིང་གསོབ་གསོག་སྙིང་པོ་མེད་ལ་བདག་ཡོད་མ་ཡིན་སྟོང་པར་གྱུར་པ་སྟེ། །
en: “All things move and change and are impermanent like clouds; They may be likened to a flash of lightning. They are like a dewdrop on a blade of grass, and deceptive like an empty fist; They have no essence and no self, and lack intrinsic existence in every way.

source: ང་ཡི་ཡིད་ནི་ཡུལ་ལ་ཆགས་པ་མེད་ཀྱིས་འདུན་པ་རྟ་རྒྱལ་དམ་པ་བསྔགས་ལྡན་ང་བྱིན་ངས་སྔོན་བསམས་པའི་བཀྲ་ཤིས་རྫོགས་ཀྱིས་ཐམས་ཅད་ཟིལ་གནོན་ཆོས་ཀུན་དབང་ཕྱུག་ཆོས་རྒྱལ་ཐུབ་པར་འགྱུར།
en: “So my mind is not attached to objects anymore. Chanda, bring me Kaṇṭhaka, well adorned, the supreme king of all horses. My auspicious aspirations from the past have been fulfilled; Overcoming everything, I will become a master of all phenomena, a king of Dharma, a sage.”

source: །འདུན་པས་སྨྲས་པ།
en: Chanda replied:

source: པད་མ་འདབ་མ་རྒྱས་པ་འདྲ་བའི་མིག་ལྡན་ཞིང་། །དོ་ཤལ་ནོར་བུ་རིན་ཆེན་སྣ་ཚོགས་རྣམས་ཀྱིས་བརྒྱན། །མཁའ་ལ་སྤྲིན་ཚོགས་དག་ལས་བྱུང་བའི་གློག་འདྲ་བ། །མལ་ན་རྣམ་པར་མཛེས་པ་འདི་ལ་མི་གཟིགས་སམ། །
en: “Don’t you see these women with eyes like blooming lotuses, Who are adorned with garlands of many precious gems, Sparkling like a flash of lightning amid cloud banks in the sky, So beautiful as they rest on their beds?

source: པི་ལྡིར་དང་ནི་ཁར་རྔ་དག་དང་སྒྲ་སྙན་དང་། །རྫ་རྔ་དག་དང་གླིང་བུ་གླུ་དབྱངས་ལེན་པ་དང་། །བྱ་བང་རྨ་བྱ་ཀ་ལ་པིང་ཀ་སྒྲ་འབྱིན་པ། །མིའམ་ཅི་ཡི་ཁྱིམ་འདྲ་འདི་ཡང་དོར་ལགས་སམ། །སུ་མ་ན་དང་ཨུད་པ་ལ་དང་པཱར་ཤི་ཀ །
en: “Or those who play such sweet-sounding flutes and cymbals, Clay drums and reed pipes, making music and song, Accompanied by the sounds of partridge, peacocks, and cuckoos? Are you going to abandon this place, which is like a city of kinnaras?

source: ཙམ་པ་ཀ་དང་དྲི་མཆོག་ཕྲེང་བ་མེ་ཏོག་བརྒྱུས། །དུས་ཀྱི་ཨ་ག་རུ་མཆོག་བདུག་པས་རབ་བདུགས་དང་། །བྱུག་པ་དམ་པ་དེ་དག་ལ་ཡང་མི་གཟིགས་སམ།
en: “Here are many flowers, such as jasmine, blue lotuses, coral jasmine, and campakas, And fragrant garlands with masses of fine blossoms. We have perfectly scented incense made of black aloeswood, And sublime scented ointments. Do you not see all of this?

source: །ཤིན་ཏུ་དྲི་བདའ་དྲི་ལྡན་རོ་བྲོ་གྱ་ནོམ་དང་། །སྐྱུ་རུམ་དག་དང་བཤོས་གཙང་ཤིན་ཏུ་ལེགས་སྦྱར་དང་། །སྐྱེམས་ཀྱི་རོ་ཡང་ཁ་ར་བཅས་པར་རབ་སྦྱར་བ། །
en: “Here you get the finest cuisine and the best dishes, With exquisite flavors, emitting superb aromas, Along with the sweetest beverages.

source: འདི་ལའང་མི་གཟིགས་པར་ནི་ལྷ་ཁྱོད་གང་དུ་བཞུད། །གྲང་བའི་དུས་ན་བྱུག་པ་དྲོ་བ་དམ་པ་དང་། །
en: Do you not see them, my Lord? Where will you go? “Here your garments are scented in the cold season with warming oils,

source: ཚ་བའི་དུས་ན་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོ་དང་། །ཀ་ཤི་པ་ཡི་ན་བཟའ་བཟང་པོ་མང་པོ་དང་། །དེ་དག་ལ་ཡང་མི་གཟིགས་ལྷ་ཁྱོད་གང་དུ་བཞུད།
en: And in the hot season, with sandalwood. You have beautiful, fine silken clothing; Do you not see them, my Lord? Where will you go?

source: །ལྷ་ཡུལ་དག་ན་ལྷ་རྣམས་དག་ནི་ཅི་འདྲ་བར། །འདོད་པའི་ཡོན་ཏན་ལྔ་པོ་འདི་དག་རབ་འབྱོར་པ།
en: “Here are the five sense pleasures, As exquisite as the divine pleasures in the god realms.

source: །དགའ་ཞིང་བདེ་དང་ལྡན་ལ་དགྱེས་པར་རོལ་མཛོད་དེ།
en: Now, enjoy and revel in them with delight and bliss!

source: །དེ་ནས་ཤཱཀྱའི་དམ་པ་ནགས་ཚལ་བཞུད་པར་མཛོད།
en: Then later, Noble Lord of the Śākyas, you can retreat to the forest!”

source: འདུན་པ་ངས་ནི་བསྐལ་པ་མཐའ་ཡས་དཔག་ཏུ་མེད་པར་གཟུགས་དང་སྒྲ་དང་དྲི་དང་རོ་དང་རེག་དང་མི་དང་ལྷ་ཡི་འདོད་པ་རྣམ་པ་སྣ་ཚོགས་སྤྱད་ཀྱང་ངོམས་པར་གྱུར་པ་མེད། །རྒྱལ་པོའི་སྲས་མཆོག་གྱུར་ཏེ་དབང་ཕྱུག་བྱས་ཤིང་གང་ཚེ་གླིང་བཞི་དག་ཏུ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་གྱུར་ནས་རིན་ཆེན་སྣ་བདུན་ལྡན་ཞིང་བུད་མེད་དག་གི་ནང་ན་འདུག་པ་དང་། །སུམ་ཅུ་རྩ་གསུམ་དབང་དང་འཐབ་བྲལ་རབ་ཀྱི་ལྷ་དབང་བྱས་ཤིང་དེ་དག་ནས་ནི་ཤི་འཕོས་འདིར་འོངས་སྤྲུལ་པའི་ལྷ་ཡི་ནང་ན་ཡིད་འོང་དཔལ་ལྡན་དམ་པ་ང་ཡིས་སྔོན་ཆད་སྤྱད། །
en: “Chanda, for countless eons beyond measure I have enjoyed the many sense pleasures of humans and gods, In the manner of forms, sounds, smells, tastes, and textures, Yet I have failed to become satisfied! “I have been a supreme royal son, so rich in power! I have been a universal monarch, ruling over the four continents. I possessed the seven treasures, And I lived in the midst of ladies. “I ruled over the Heaven of the Thirty-Three and the Heaven Free from Strife; I left those realms and came here. In the past I enjoyed the most sacred and superb objects Among the gods of emanations.

source: ལྷ་ཡི་གནས་སུ་དབང་སྒྱུར་བདུད་ཀྱི་དབང་པོ་བྱས་ཤིང་འདོད་པ་འབྱོར་པ་མཆོག་ལ་སྤྱད་ཀྱང་ངོམས་མ་གྱུར་ན་ད་ཅི་དམན་པ་འདི་ལ་བསྟེན་པས་ང་ངོམས་འགྱུར་རམ་དེ་ནི་གནས་མིན་ནོ།
en: “I have been the lord of demons, who controls the realms of gods; I have enjoyed the best and most exquisite sense pleasures, but found no satisfaction. How then would I find satisfaction now by indulging in inferior pleasures? This is out of the question!

source: །གཞན་ཡང་འདུན་པ་ང་ནི་སྡུག་བསྔལ་མྱ་ངན་དགོན་པའི་འཁོར་བར་གནས་པ་ཉོན་མོངས་གདུག་པས་དཀྲུགས་ཤིང་ཉམ་ངས་རྟག་ཏུ་ཁྱེར་ཏེ་མགོན་མེད་སྐྱབས་མེད་ཅིང་། །
en: “Moreover, Chanda, I see that this world is suffering; It is caught in the midst of cyclic existence. It is a wilderness of misery, full of afflictions and evil, Where beings are constantly swept away. “Without refuge or purpose, beings wander in the darkness of ignorance and delusion;

source: གཏི་མུག་མ་རིག་མུན་པ་དག་ན་རྒ་དང་ན་དང་འཆི་བའི་འཇིགས་པ་དག་གིས་ཉེན་ལ་སྐྱེ་བའི་སྡུག་བསྔལ་དགྲ་ཡིས་ཀུན་ཏུ་གནོད་ཅིང་རྣམ་པར་གནོད་པའི་འགྲོ་བ་འདི་བལྟས་ནས།
en: They suffer from the terrors of old age, sickness, and death. They are assailed by the sufferings attendant upon taking birth, And they suffer the onslaughts of enemies.

source: །ངས་འདིར་ཆོས་ཀྱི་གྲུ་བཟང་གཏོང་དང་ཚུལ་ཁྲིམས་བརྟུལ་ཞུགས་བཟོད་པ་བརྩོན་འགྲུས་སྟོབས་ཅན་དག་གི་ཤིང་ཚོགས་བསོགས་ཏེ་སྦྱར་ནས་ལྷག་པའི་བསམ་པ་སྙིང་པོ་ལྡན་པ་རྡོ་རྗེ་ལྟ་བུས་བརྟན་པོར་གཟུངས་བཏབ་སྦྱར།
en: “So I will now assemble the ship of Dharma. It is constructed with the strongest wood— Giving, disciplined conduct, patience, and diligence— And firmly secured by my indestructible, superior motivation.

source: །གྲུ་དེར་ང་ཉིད་ཞུགས་ནས་བདག་ཉིད་རྒལ་ཏེ་བདག་གིས་འགྲོ་བ་མཐའ་ཡས་པ་དག་འཁོར་བའི་ཆུ་བོ་འདའ་བར་ཆེ་བ་ཁྲོ་བའི་དབའ་རླབས་ལྡན་པ་འདོད་ཆགས་འཛིན་ཁྲི་གློང་འཁྱིལ་དགྲ་ཡིས་རྣམ་པར་དཀྲུགས་པ་རྒལ་བར་དཀའ་ལས་བསྒྲལ་ལོ་སྙམ་སྟེ་ང་སེམས་དེ་འདྲའོ།
en: “It is my resolve to board that ship and cross the ocean of cyclic existence. Then I will ferry innumerable beings across this ocean, This sea of suffering so hard to cross with its waves of anger, Monsters of passion, and maelstroms of enmity.

source: །དེ་ཕྱིར་སྲིད་འཚོ་དགྲར་བཅས་ལྟ་བའི་འཛིན་ཁྲི་དང་། །ཉོན་མོངས་སྲིན་པོ་ཡོད་པ་འདི་ལས་བདག་རྒལ་ཏེ། །
en: “I will cross the ocean of existence, Infested with the monsters of harmful views and the demons of affliction.

source: བདག་ཉིད་རྒལ་བར་གྱུར་ནས་འགྲོ་བ་མཐའ་ཡས་པ། །རྒ་མེད་ཤི་མེད་ཞི་བའི་ཐང་ལ་དགོད་པར་བྱ།
en: Once I have ferried innumerable beings across, I will establish them on the auspicious dry land without old age or death.”

source: །དེའི་ཚེ་འདུན་པ་དེ་བས་ཀྱང་རབ་ཏུ་ངུ་ཞིང་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་དེ་ལྟར་ངེས་པར་མཛད་དམ།
en: At that time Chanda, who now cried even harder, exclaimed, “Lord, is your resolve based on conviction?”

source: བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ།
en: The Bodhisattva replied:

source: འདུན་པ་ང་ཡིས་ངེས་པར་བྱས་པ་ཉོན།
en: “Chanda, listen to this about my resolve:

source: །སེམས་ཅན་དགྲོལ་ཕྱིར་ཕན་པར་བྱ་ཕྱིར་བརྩོན། །མི་གཡོ་ལས་ཀྱང་མི་གཡོ་གནོད་པ་མེད། །རི་རྒྱལ་ལྷུན་པོ་ལྟ་བུར་བརྟན་མི་གཡོ།
en: I will strive to benefit and liberate beings! My resolve is like a mountain: immutable, unchangeable, and firm. It is as difficult to move as Meru, the king of mountains.”

source: །འདུན་པས་སྨྲས་པ། ཇོ་ཇོའི་ངེས་པ་ཅི་འདྲ་བ་ཞིག་ལགས།
en: Chanda then asked, “Lord, how can you be so certain?”

source: རྡོ་རྗེའི་གནམ་ལྕགས་དགྲ་སྟ་མདུང་ཐུང་མདའ་ཆར་དང་། །ལྕགས་བསྐོལ་གློག་གི་ཚོགས་ལྟར་རབ་ཏུ་འབར་བ་དང་། །རི་རྩེ་ཀུན་ཏུ་འབར་བ་མགོ་སྟེང་རབ་འབབ་ཀྱང་།
en: “Even if bolts of lightning, battle-axes, spears, and arrows were to rain upon me, And if molten iron, blazing like a fork of lightning, And an erupting volcano were to drop on my head,

source: །ང་ནི་ཁྱིམ་ལ་འདོད་པའི་ཕྱིར་ཡང་མི་སྐྱེད་དོ།
en: I would never want to be a householder again!”

source: །དེའི་ཚེ་ལྷའི་བུ་ནམ་མཁའ་ལ་འཁོད་པ་དག་གིས་ཅ་ཅོ་དང་ག་ཞའི་སྒྲ་བརྒྱ་སྟོང་ཕྱུང་སྟེ། མེ་ཏོག་གི་ཆར་ཡང་ཕབ་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: At this moment the gods who were watching from the sky uttered cries of joy and rained down flowers, exclaiming:

source: །ཡུལ་རྣམས་ལ་ནི་ཡིད་ཀྱང་མ་ཆགས་ཤིང་།
en: “With a mind not attached to any object,

source: །སེམས་ཅན་དག་པ་སྙིང་རྗེ་སྙིང་བརྩེར་ལྡན།
en: And with compassion and love for sentient beings,

source: །བློ་གྲོས་མཆོག་ལྡན་རྒྱལ་གྱུར་རྒྱལ་གྱུར་ཅིག །མགོན་པོ་འགྲོ་ལ་མི་འཇིགས་སྦྱིན་མཛད་པ།
en: May you, the one with supreme intelligence, be victorious! You are the protector who grants fearlessness to beings.

source: །མཁའ་ལ་རྡུལ་གནག་དུ་བ་མཇུག་རིངས་དག །མི་ཆགས་བཞིན་དུ་སྐྱེས་མཆོག་ཐུགས་མི་ཆགས།
en: “Like the sky, which remains unattached to darkness, dust, smoke, or comets, The mind of the Supreme Being remains unattached.

source: །དྲི་མེད་ཡུལ་གྱི་བདེ་བས་མི་གོས་ཏེ།
en: The Pure Being is unstained by pleasurable objects,

source: །ཆུ་ལས་པད་མ་ཇི་ལྟར་འཕགས་པ་བཞིན།
en: Just like a lotus rising up from the water.”

source: །དགེ་སློང་དག་དེ་ནས་ལྷའི་བུ་ཞི་བའི་བློ་གྲོས་དང་། ལྷའི་བུ་རྩེ་བ་བཀོད་པས། བྱང་ཆུབ་སེམས་དཔའི་ངེས་པ་རིག་ནས་སེར་སྐྱའི་གནས་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོའི་སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་ཐམས་ཅད་གཉིད་ཀྱིས་ལོག་པར་བྱས་སོ།
en: Monks, when the gods Śāntamati and Lalitavyūha understood the Bodhisattva’s determination, they caused all men, women, and children in the city of Kapilavastu to fall asleep.

source: །སྒྲ་ཐམས་ཅད་ཀྱང་མི་གྲག་པར་བྱས་སོ།
en: They made everything plunge into deep silence.

source: །དགེ་སློང་དག་དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་གྲོང་ཁྱེར་གྱི་སྐྱེ་བོ་ཐམས་ཅད་གཉིད་ཀྱིས་ལོག་པར་རིག །ནམ་གྱི་གུང་ལ་བབ་པར་རིག །སྐར་མའི་བདག་པོ་རྒྱལ་དང་ལྡན་པར་རིག །ད་ཁོ་ན་མངོན་པར་འབྱུང་བའི་དུས་ལ་བབ་པར་རིག་ནས་འདུན་པ་ལ་སྨྲས་པ།
en: Monks, at that moment the Bodhisattva realized that everyone in the city was sound asleep, that the hour of midnight had come, and that the moon was in the constellation of Puṣya, the lord of constellations. He was aware that right then the time had come for him to leave home. So he told his servant,

source: འདུན་པ་དང་སྐྱོ་བར་མ་བྱེད་པར་རྟ་བསྔགས་ལྡན་ལེགས་པར་བརྒྱན་ཏེ་མ་ཐོགས་པར་ང་ལ་བྱིན།
en: “Chanda, don’t badger me now. Instead, without any further delay, bring me my horse Kaṇṭhaka, well adorned.”

source: བྱང་ཆུབ་སེམས་དཔས་ཚིག་དེ་སྐད་སྨྲས་མ་ཐག་ཏུ། དེ་ནས་སྐད་ཅིག་དེ་ཉིད་ལ་རྒྱལ་པོ་ཆེན་པོ་བཞིས།
en: As soon as the Bodhisattva uttered these words, the Four Great Kings left their residences.

source: བྱང་ཆུབ་སེམས་དཔའི་ཚིག་ཐོས་ནས། རང་རང་གི་གནས་ནས་བྱུང་སྟེ།
en: They had listened to the Bodhisattva’s words and had prepared to make offerings to him.

source: བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་རང་རང་གི་བཀོད་པས་རིངས་པ་རིངས་པར་ཡང་སེར་སྐྱའི་གནས་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་འོངས་སོ། །དེ་ན་དྲི་ཟའི་བདག་པོ་རྒྱལ་པོ་ཆེན་པོ་ཡུལ་འཁོར་སྲུང་ནི་དྲི་ཟ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དག་དང་ལྷན་ཅིག་ཏུ་སིལ་སྙན་དང་གླུ་དབྱངས་སྣ་ཚོགས་ལེན་ཅིང་ཤར་ཕྱོགས་ནས་འོངས་པར་གྱུར་ཏེ།
en: Now they hurried quickly to the city of Kapilavastu. King Dhṛtarāṣṭra, lord of the gandharvas, arrived from the east together with several trillion kinnaras playing various instruments and singing songs.

source: འོངས་ནས་ཀྱང་སེར་སྐྱའི་གནས་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ལ་བསྐོར་བ་བྱས་ཏེ།
en: As soon as Dhṛtarāṣṭra arrived, he began to circumambulate the city of Kapilavastu.

source: ཇི་ལྟར་འོངས་པའི་ཤར་ཕྱོགས་ཉིད་དུ་གནས་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕྱག་འཚལ་ཞིང་འདུག་གོ།
en: Stopping in the east, from where he had arrived, he paid homage to the Bodhisattva.

source: །རྒྱལ་པོ་ཆེན་པོ་འཕགས་སྐྱེས་པོ་ནི་གྲུལ་བུམ་མུ་ཏིག་གི་དོ་ཤལ་སྣ་ཚོགས་ལག་ན་འཕྱང་བ། ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཐོགས་པ། སྤོས་ཆུ་སྣ་ཚོགས་ཀྱིས་གང་བའི་བུམ་པ་ཐོགས་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དག་དང་ལྷན་ཅིག་ཏུ་ལྷོ་ཕྱོགས་ནས་འོངས་པར་གྱུར་ཏེ།
en: The great king Virūḍhaka arrived from the south with several trillion kumbhāṇḍas holding in their hands various pearl necklaces. In addition they carried various precious gems, and vases filled with different types of perfumes.

source: ཇི་ལྟར་འོངས་པའི་ལྷོ་ཕྱོགས་ཉིད་དུ་གནས་ནས། བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕྱག་འཚལ་ཞིང་འདུག་གོ།
en: Stopping in the south, from where he had arrived, he paid homage to the Bodhisattva.

source: །རྒྱལ་པོ་ཆེན་པོ་མིག་མི་བཟང་ནི་ཀླུ་མུ་ཏིག་གི་དོ་ཤལ་སྣ་ཚོགས་ལག་ན་འཕྱང་བ། ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཐོགས་པ། སྤོས་ཀྱི་ཕྱེ་མ་དང་མེ་ཏོག་གི་ཆར་གྱི་སྤྲིན་ཀུན་ནས་སློང་བའི་རླུང་དལ་ཞིང་དྲི་ཞིམ་པ་སྣ་ཚོགས་གཏོང་བ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དག་དང་ལྷན་ཅིག་ཏུ་ནུབ་ཕྱོགས་ནས་འོངས་པར་གྱུར་ཏེ།
en: The great king Virūpākṣa arrived from the west with several trillion nāgas holding in their hands various necklaces made of pearls and different types of precious gems. They sent forth a gentle breeze from a rain of flowers and perfumed powders that emitted beautiful scents.

source: ཇི་ལྟར་འོངས་པའི་ནུབ་ཕྱོགས་ཉིད་དུ་གནས་ནས། བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕྱག་འཚལ་ཞིང་འདུག་གོ།
en: Stopping in the west, from where he had arrived, he paid homage to the Bodhisattva.

source: །རྒྱལ་པོ་ཆེན་པོ་ལུས་ངན་ནི་གནོད་སྦྱིན་ནོར་བུ་རིན་པོ་ཆེ་སྐར་མའི་འོད་ཟེར་ཐོགས་པ།
en: The great king Kubera arrived from the north with several trillion yakṣas holding in their hands precious jewels of the type called starlight.

source: ལག་ན་མར་མེ་ཐོགས་པ། སྒྲོན་མ་འབར་བ་ལག་ན་ཐོགས་པ།
en: They also carried oil lamps and lighted lanterns.

source: མདའ་གཞུ་དང་། རལ་གྲི་དང་། མདུང་ཐུང་དང་། མཚོན་རྩེ་གཉིས་པ་དང་། རྩེ་གསུམ་པ་དང་། འཁོར་ལོ་དང་། མཚོན་རྩེ་གཅིག་པ་དང་། འཕང་མདུང་ལ་སོགས་པ་མཚོན་ཆ་སྣ་ཚོགས་ཐོགས་པ། གོ་ཆ་དང་ཡ་ལད་སྲ་བ་བགོས་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དག་དང་ལྷན་ཅིག་ཏུ་བྱང་ཕྱོགས་ནས་འོངས་པར་གྱུར་ཏེ།
en: They held in their hands various weapons, such as bows and arrows, swords, spears, lances with two and three points, discuses, one-pointed pikes, and javelins, and they were armed with strong armor and helmets.

source: ཇི་ལྟར་འོངས་པའི་བྱང་ཕྱོགས་ཉིད་དུ་གནས་ནས། བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕྱག་འཚལ་ཞིང་འདུག་གོ།
en: Then he settled in the northern direction, from where he had arrived, and paid homage to the Bodhisattva.

source: །ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ཡང་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ། ལྷའི་མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། མེ་ཏོག་གི་རྣ་རྒྱན་དང་། རྒྱན་ཐོགས་པ་རྣམས་དང་། ལྷན་ཅིག་ཏུ་འོངས་པར་གྱུར་ཏེ།
en: Thereafter Śakra, lord of the gods, arrived together with the gods from the Heaven of the Thirty-Three, bringing divine flowers, perfumes, garlands, ointments, scented powders, garments, parasols, victory banners, flags, earrings, and adornments.

source: ཇི་ལྟར་འོངས་པའི་སྟེང་གི་བར་སྣང་ལ་འཁོར་དང་བཅས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕྱག་འཚལ་ཞིང་འདུག་གོ།
en: Then he settled together with his retinue in the space above, in the same direction from which he had come, and began to pay homage to the Bodhisattva.
